# WIDTH_FROM_ORIGIN  = 755 # 原点からの距離
# HEIGHT_FROM_ORIGIN = 0 # 原点からの距離
##okano
# WIDTH_FROM_ORIGIN  = 0 # 原点からの距離
# HEIGHT_FROM_ORIGIN = 860 # 原点からの距離
WIDTH_FROM_ORIGIN  = 1430 # 原点からの距離
HEIGHT_FROM_ORIGIN = 9430 # 原点からの距離
TRANSFORM_WIDTH    = 891 # A4マットサイズ
TRANSFORM_HEIGHT   = 1260 # A4マットサイズ
TRANSFORM_SIZE     = [
    (WIDTH_FROM_ORIGIN, HEIGHT_FROM_ORIGIN),
    (WIDTH_FROM_ORIGIN + TRANSFORM_WIDTH, HEIGHT_FROM_ORIGIN),
    (WIDTH_FROM_ORIGIN + TRANSFORM_WIDTH, HEIGHT_FROM_ORIGIN + TRANSFORM_HEIGHT),
    (WIDTH_FROM_ORIGIN, HEIGHT_FROM_ORIGIN + TRANSFORM_HEIGHT)
]

WIDTH_FROM_ORIGIN2  = 1430 # 原点からの距離
HEIGHT_FROM_ORIGIN2 = 9430 # 原点からの距離
TRANSFORM_WIDTH2    = 891 # A4マットサイズ
TRANSFORM_HEIGHT2   = 1260 # A4マットサイズ
# WIDTH_FROM_ORIGIN2  = 1100 # 原点からの距離
# HEIGHT_FROM_ORIGIN2 = 0 # 原点からの距離
# TRANSFORM_WIDTH2    = 891 # A4マットサイズ
# TRANSFORM_HEIGHT2   = 1260 # A4マットサイズ
TRANSFORM_SIZE2     = [
    (WIDTH_FROM_ORIGIN2, HEIGHT_FROM_ORIGIN2),
    (WIDTH_FROM_ORIGIN2 + TRANSFORM_WIDTH2, HEIGHT_FROM_ORIGIN2),
    (WIDTH_FROM_ORIGIN2 + TRANSFORM_WIDTH2, HEIGHT_FROM_ORIGIN2 + TRANSFORM_HEIGHT2),
    (WIDTH_FROM_ORIGIN2, HEIGHT_FROM_ORIGIN2 + TRANSFORM_HEIGHT2)
]

CAMERA_CONFIG = {
    # 'カメラコード': {
        # area_size     : 画像におけるエリアのxy座標(1. 左上, 2. 右上, 3. 右下, 4. 左下)(単位: px),
        # transform_size: エリア実寸距離,
        # mtx: 歪み補正のパラメータ,
        # dist: 同上,
        # new_mtx: 同上,
    # }
    # 'HOB3334312': { # 192.168.1.146
    'YTS9260905': { # 192.168.1.146  2024/09/04 torisato
        # 'area_size': [ (837, 466), (1036, 487), (1050, 646), (796, 619)],
        'area_size': [(645, 450), (796, 525), (556, 696), (385, 582)],
        'transform_size': TRANSFORM_SIZE2,
        'mtx': [[1542.4508716280939, 0.0, 948.1521486760594], [0.0, 1542.1962286710693, 476.3881571821533], [0.0, 0.0, 1.0]],
        'dist': [[-0.5321055180086637, 0.3239812140797066, 0.0028059721018370877, 7.379663726233273e-05, -0.1104810690100608]],
        'new_mtx': [[948.3254474974129, 0.0, 924.7022030378648], [0.0, 966.5367341621568, 455.9390510430943], [0.0, 0.0, 1.0]]
        # 'mtx': [[1679.0200813871422, 0.0, 1052.167530073015], [0.0, 1671.732371144241, 592.0534988696801], [0.0, 0.0, 1.0]],
        # 'dist': [[-0.5526805520446422, 0.23601084594096944, -0.017556477951132802, -0.010726559738187792, 0.11905238197025689]],
        # 'new_mtx': [[1275.8411948951712, 0.0, 1020.3177596821272], [0.0, 1268.801748181824, 561.8070079587526], [0.0, 0.0, 1.0]]
    },
    'SXL1838411': { # 192.168.1.153  2024/09/04 torisato
        'area_size': [(725, 559), (860, 487), (999, 552), (865, 645)],              # ピクセル値(CC)
        'transform_size': TRANSFORM_SIZE, # 展示会用実寸距離(CC)
        'mtx': [[1625.5104630844037, 0.0, 1085.2334707963762], [0.0, 1606.0734975465514, 646.8846003728407], [0.0, 0.0, 1.0]],
        'dist': [[-0.5378650145071094, 0.35560627006024353, -0.011724796681730279, -0.011095106583931012, -0.1747325365132236]],
        'new_mtx': [[804.3041075410623, 0.0, 1301.4831049199042], [0.0, 795.9822207221862, 511.0666464974362], [0.0, 0.0, 1.0]]
    },
    'XNB8167968': { # 192.168.1.153
        'area_size': [(1075, 303), (1260, 307), (1274, 357), (1066, 355)],              # ピクセル値(CC)
        # 'area_size': [ (87, 654), (366, 559), (577, 654), (316, 777)],              # ピクセル値(CC)
        'transform_size': TRANSFORM_SIZE2, # 展示会用実寸距離(CC)
        # 'mtx': [[1653.6332196272183, 0.0, 961.0435062299955], [0.0, 1630.5898444631384, 523.4278327052099], [0.0, 0.0, 1.0]],
        # 'dist': [[-0.6128300470875767, 0.6881297852473536, 0.0029804051290786824, 0.0019014367177228736, -1.015292669763434]],
        # 'new_mtx': [[1449.869365048566, 0.0, 997.8499212203162], [0.0, 1073.8535386907092, 506.33761464525327], [0.0, 0.0, 1.0]]
        #
        'mtx': [[1598.8987953616981, 0.0, 1154.5721428669267], [0.0, 1611.954052703743, 575.464035614948], [0.0, 0.0, 1.0]],
        'dist':  [[-0.5103362587563911, 0.2389765977705196, -0.00042621947623841083, -0.022340410454854815, -0.06838522872057898]],
        'new_mtx': [[939.367043010585, 0.0, 1251.3530553387372], [0.0, 881.4426892722822, 613.3733748520142], [0.0, 0.0, 1.0]]
        #
        # 'area_size': [(855, 559), (1112, 523), (1173, 607), (876, 651)],              # ピクセル値(CC)
        # # 'area_size': [ (87, 654), (366, 559), (577, 654), (316, 777)],              # ピクセル値(CC)
        # 'transform_size': TRANSFORM_SIZE, # 展示会用実寸距離(CC)
        # # 'mtx': [[1653.6332196272183, 0.0, 961.0435062299955], [0.0, 1630.5898444631384, 523.4278327052099], [0.0, 0.0, 1.0]],
        # # 'dist': [[-0.6128300470875767, 0.6881297852473536, 0.0029804051290786824, 0.0019014367177228736, -1.015292669763434]],
        # # 'new_mtx': [[1449.869365048566, 0.0, 997.8499212203162], [0.0, 1073.8535386907092, 506.33761464525327], [0.0, 0.0, 1.0]]
        #
        # 'mtx': [[1609.2449244089669, 0.0, 1000.0481524747349], [0.0, 1605.3840072562475, 537.559708546997], [0.0, 0.0, 1.0]],
        # 'dist': [[-0.5016204272305949, 0.20074884524533518, 0.0014581672755574456, -0.002434920096525618, 0.004335305553592448]],
        # 'new_mtx': [[1145.0645209704444, 0.0, 1001.9450300569405], [0.0, 1138.6991163248595, 541.2762885972496], [0.0, 0.0, 1.0]]
    },
    'ZGY8586252': { 
        'area_size': [(725, 559), (860, 487), (999, 552), (865, 645)],              # ピクセル値(CC)
        'transform_size': TRANSFORM_SIZE, # 展示会用実寸距離(CC)
        'mtx': [[3911.476049237538, 0.0, 1166.4795721626028], [0.0, 4091.6017167430246, 400.3864233689553], [0.0, 0.0, 1.0]],
        'dist': [[0.2970213984137191, 54.23332366727016, 0.16697839642622314, -0.39791219627838154, -896.7763841823471]],
        'new_mtx': [[2300.5106241080093, 0.0, 686.0577988424923], [0.0, 3451.7814074027506, 418.6082792514696], [0.0, 0.0, 1.0]]
    },
    'KTC0636763': { 
        'area_size': [(1351, 603), (1493, 730), (1194, 783), (1098, 633)],              # ピクセル値(CC)
        'transform_size': TRANSFORM_SIZE, # 展示会用実寸距離(CC)
        'mtx': [[1541.1078967326055, 0.0, 979.3167058359963], [0.0, 1538.0406979693112, 534.5424998530001], [0.0, 0.0, 1.0]],
        'dist': [[-0.535098830888248, 0.34513918126541343, -0.0016724825124039815, -0.0014871164199184643, -0.13715719241406613]],
        'new_mtx': [[904.2430983000374, 0.0, 1021.9106366008148], [0.0, 889.228751308428, 513.716349818159], [0.0, 0.0, 1.0]]
    }
}

# マッピング用縮尺
# WIDTH, HEIGHT = 3440,5000
WIDTH, HEIGHT = 5930,12550
WIDTH2, HEIGHT2 = 5930,12550
# REDUCTION_RATIO = (1080/WIDTH, 1920/HEIGHT) # 縦長
# REDUCTION_RATIO = (1920/WIDTH, 1080/HEIGHT) # 横長
WINDOW_SIZE = (860, 648)
BODY_RATIO = 0.25

###カメラから見た座標取得
# #Y軸考慮
# #手前の全身（基準とする）
# front_bbox=[724,303,1099,1062]
# #奥の全身
# back_bbox=[825,48,1000,520]

# front_height=front_bbox[3]-front_bbox[1]
# back_height=back_bbox[3]-back_bbox[1]

# amount_change_y= (front_height - back_height) / (front_bbox[1]-back_bbox[1])

# #X軸考慮
# #左の全身
# left_box=[1072,215,1367,986]
# #右の全身
# right_box=[236,215,447,753]

# left_height=left_box[3]-left_box[1]
# right_height=right_box[3]-right_box[1]
# if left_height > right_height:
#     amount_change_x = (left_height - right_height) / (left_box[0]-right_box[0])
#     big_x=left_box[0]
# else:
#     amount_change_x = (right_height - left_height) / (right_box[0]-left_box[0])
#     big_x=right_box[0]
    
# # obstacle_list=[[344,230,1236,589]]
# obstacle_list=[[(472,196),(1267,459),(1003,714),(256,372)]]
#Y軸考慮
# #手前の全身（基準とする）
# front_bbox=[615,209,892,1040]
# #奥の全身
# back_bbox=[949,7,1066,393]

def y_change(front_bbox,back_bbox):
    front_height=front_bbox[3]-front_bbox[1]
    back_height=back_bbox[3]-back_bbox[1]

    amount_change_y= (front_height - back_height) / (front_bbox[1]-back_bbox[1])

    return front_height,amount_change_y

#X軸考慮
# #左の全身
# left_box=[946,5,1062,374]
# #右の全身
# right_box=[1631,29,1721,335]

def x_change(left_box,right_box):
    left_height=left_box[3]-left_box[1]
    right_height=right_box[3]-right_box[1]
    if left_height > right_height:
        amount_change_x = abs((left_height - right_height) / (left_box[0]-right_box[0]))
        # big_x=left_box[0]
        big_x=160
    else:
        amount_change_x = abs((right_height - left_height) / (right_box[0]-left_box[0]))
        # big_x=right_box[0]
        big_x=160

    return amount_change_x,big_x
    
# obstacle_list=[[344,230,1236,589]]

camera1=1
camera2=2
camera3=3
camera5=5
camera_list=[camera2,camera1]
camera_pairs=[(camera2,camera1)]
CAMERA_AREA = {
    f'{camera1}': [0,0,1080,1920],
    f'{camera5}': [0,0,1080,1920],
    f'{camera3}': [0,1820,1080,3740],
    f'{camera2}': [0,1820,1080,3740],
}

obstacle_list={
    f'{camera1}': [],
    # f'{camera1}': [[(663, 86), (921, 196), (872, 327), (575, 199)]],
    f'{camera2}': [],
}

#左から手前、奥、左、右の順番
bbox_list={
    f'{camera1}': [[163,168,500,1080],[235,0,442,676],[163,168,500,1080],[1666,163,1896,721]],
    f'{camera2}': [[1360,237,1748,1035],[1544,2,1695,407],[0,122,249,862],[1478,150,1762,841]],
    # f'{camera5}': [[1046,160,1434,1080],[1047,16,1279,679],[339,19,584,786],[1066,29,1306,673]],
}
REDUCTION_RATIO = {
    f'{camera2}': (1080/WIDTH, 1920/HEIGHT),
    f'{camera1}': (1080/WIDTH2, 1920/HEIGHT2),
    f'{camera3}': (1080/WIDTH, 1920/HEIGHT),
    f'{camera5}': (1080/WIDTH, 1920/HEIGHT),
}
world_map=(1080,1920)